<template>
  <div class="home">
    

    <Article :data="{
      header : `วิธีการดูแลสุขภาพของตัวคุณและคนที่คุณรัก`, 
      content : `การมีสุขภาพที่แข็งแรงปราศจากโรคภัยไข้เจ็บคงเป็นสิ่งที่ใครหลายคนปรารถนา แต่ถ้าเราอยากมีสุขภาพที่แข็งแรงเราจำเป็นที่จะต้องรู้จักวิธีการดูแลร่างกายของเราในการใช้ชีวิตประจำวันกันด้วย และสำหรับเคล็ดลับการดูแลสุขภาพให้ดีนั้นเราสามารถปฏิบัติได้ตามวิธีต่างๆ ดังนี้ค่ะ`
    }" />

    <About></About>

    <Bar />

    <!-- <router-view /> -->

    <!-- <About />
    
    <Article v-for="(data, index) in datas" :key="index" :data="data" />

    <p class="mb-0 mt-2 text-left" style="text-indent: 24px">ใครที่อยากมีสุขภาพที่สมบูรณ์แข็งแรงอย่าลืมปฏิบัติตัวตามคำแนะนำต่างๆ เหล่านี้กันดูนะคะ การไม่มีโรคถือเป็นลาภอันประเสริฐ แต่ถ้าคุณสามารถปฏิบัติตัวตามคำแนะนำข้างต้น ก็รับรองได้เลยว่าคุณจะมีสุขภาพที่สมบูรณ์แข็งแรงและห่างไกลจากโรคต่างๆ อย่างแน่นอน</p> -->


        
  </div>
</template>

<script>
// @ is an alias to /src
import HelloWorld from '@/components/HelloWorld.vue'
import Article from '@/components/Article.vue'

import Bar from '@/components/Bar.vue'

import About from '@/views/About.vue'

const datas = [
  {
    header : `ทานอาหารให้ครบทั้ง 3 มื้อ`, 
    content : `อาหารที่รับประทานควรให้ครบหลักโภชนาการ 5 หมู่ เพื่อให้ร่างกายของเราได้รับสารอาหารอย่างพอเพียง และสามารถนำไปใช้ประโยชน์ได้อย่างเต็มที่ โดยเฉพาะอาหารในมื้อเช้าซึ่งถือว่าเป็นมื้อที่สำคัญที่สุดในแต่ละวัน การรับประทานอาหารมื้อเช้ายังช่วยป้องกันความเสี่ยงในการเกิดโรคได้อีกด้วย โดยเฉพาะความเสี่ยงในการเกิดโรคเบาหวาน นอกจากนี้เราควรเลือกรับประทานแต่อาหารที่มีประโยชน์ เช่น ผักและผลไม้ และให้หลีกเลี่ยงอาหารประเภทของหมักดอง ของทอด และของมัน เพื่อให้ร่างกายไม่เกิดการสะสมไขมันและมีสารตกค้าง นอกจากนี้ไขมันที่สะสมอยู่ในร่างกายยังเป็นสาเหตุสำคัญที่ทำให้คุณเกิดเป็นโรคต่างๆ ที่เป็นอันตรายร้ายแรงต่อสุขภาพร่างกายกันอีกด้วย`, 
  }, 
  {
    header : `ดื่มน้ำสะอาด`, 
    content : `ควรดื่มน้ำเป็นประจำโดยจิบตลอดทั้งวันให้ได้อย่างน้อยวันละ 7-8 แก้ว เพราะน้ำมีส่วนในการช่วยให้ร่างกายสามารถเผาพลาญได้ดีขึ้น และทำให้เลือดไหลเวียนดี น้ำยังมีส่วนในการช่วยบำรุงผิวพรรณของเราไม่ให้แห้งหยาบกร้านอีกด้วย`, 
  }, 
  {
    header : `ออกกำลังกายอย่างสม่ำเสมอ`, 
    content : `โดยเลือกออกกำลังให้สมวัยและไม่ออกกำลังกายให้หักโหมจนเกินไป การออกกำลังกายจะมีส่วนช่วยให้ร่างกายสามารถเผาพลาญพลังงานต่างๆ ได้ดีขึ้น ช่วยกระชับกล้ามเนื้อ ทำให้กล้ามเนื้อแข็งแรง และช่วยให้ร่างกายสามารถสร้างภูมิคุ้มกันโรคต่างๆ ได้ดีขึ้น สำหรับการออกกำลังกายคุณควรเลือกออกกำลังกายแบบง่ายๆ เช่น การวิ่ง การเดิน ว่ายน้ำ เล่นโยคะ กิจกรรมเข้าจังหวะ ขี่จักรยาน เป็นต้น และควรออกกำลังกายในที่ที่มีอากาศถ่ายเทสะดวก เช่น ในสวนย่อม สนามกีฬา หรือสวนสาธารณะ เป็นต้น`, 
  }, 
  {
    header : `นอนหลับพักผ่อนให้เพียงพอ`, 
    content : `ควรนอนหลับให้ได้อย่างน้อยวันละ 7-8 ชั่วโมง การนอนจะทำให้ร่างกายสามารถเข้าไปซ่อมแซมส่วนที่สึกหรอได้อย่างเต็มที่ และเวลาที่เรานอนร่างกายของเรายังสามารถเผาพลาญพลังงานต่างๆ ได้ดีขึ้นด้วย ใครที่เข้านอนไวมักจะไม่อ้วน นอกจากนี้แล้วถ้าเรานอนหลับพักผ่อนอย่างเพียงพอยังมีส่วนช่วยให้เรามีผิวพรรณที่สดใส และช่วยให้สมองปลอดโปร่ง มีความจำดี คิดอ่านได้ฉับไว`, 
  }, 
  {
    header : `ไม่ซื้อยารับประทานเอง`, 
    content : `ถ้ารู้สึกตัวว่าไม่สบาย ควรไปพบแพทย์เพื่อทำการวินิจฉัยโรคและหาแนวทางในการรักษา อย่าพยายามซื้อยารับประทานเอง เพราะโรคต่างๆ บางครั้งจะมีอาการคล้ายคลึงกัน เราอาจจะแยกไม่ออกว่าอาการที่เราเป็นอยู่นั้นเป็นโรคเกี่ยวกับอะไรกันแน่ คุณหมอจะเป็นผู้ที่วินิจฉัยและให้คำตอบได้ดีที่สุด`, 
  }, 
  {
    header : `ตรวจสุขภาพเป็นประจำทุกปี`, 
    content : `เพราะโรคต่างๆ สามารถรักษาให้หายขาดได้ถ้าเราพบกันตั้งแต่เนิ่นๆ ปัจจุบันจึงได้มีการรณรงค์ให้ผู้คนทั่วไปโดยเฉพาะหนุ่มสาวในวัยทำงาน และผู้สูงอายุควรตรวจสุขภาพร่างกายกันเป็นประจำ`, 
  }, 
  {
    header : `รักษาความสะอาดอยู่เสมอ`, 
    content : `ควรอาบน้ำให้ได้อย่างน้อยวันละ 2 ครั้ง และก่อนรับประทานอาหารหรือหยิบจับอาหารเข้าปากควรล้างมือให้สะอาด หรือทุกครั้งที่กลับถึงบ้านหรือที่ทำงานควรล้างมือก่อนทุกครั้ง`, 
  }, 
]

export default {
  name: 'Home',
  components: {
    Article, 
    About,
    Bar,
  }, 
  
  data() {
    return {
      datas : datas, 
    }
  }
}
</script>

